Ran Plan for 2 projects:

1. dir: `project2` workspace: `default`
1. dir: `project1` workspace: `default`

### 1. dir: `project2` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/GeetaSree13/terraform_new/3/default/project2/default.tfplan\"" in "/home/atlantis/.atlantis/repos/GeetaSree13/terraform_new/3/default/project2": exit status 1
module.vm[0].google_compute_firewall.allowing-https: Refreshing state... [id=projects/stable-parsec-462607-h1/global/firewalls/allowing-https]
module.vm[0].google_compute_firewall.allowing-http: Refreshing state... [id=projects/stable-parsec-462607-h1/global/firewalls/allowing-http]
module.vm[0].google_compute_instance.vm_instance: Refreshing state... [id=projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2]

Error: Error when reading or editing Instance terraform-instance-project2: googleapi: Error 403: Required 'compute.instances.get' permission for 'projects/stable-parsec-462607-h1/zones/asia-southeast1-a/instances/terraform-instance-project2', forbidden

  with module.vm[0].google_compute_instance.vm_instance,
  on ../modules/VM/main.tf line 1, in resource "google_compute_instance" "vm_instance":
   1: resource "google_compute_instance" "vm_instance" {


Error: Error when reading or editing ComputeFirewall "projects/stable-parsec-462607-h1/global/firewalls/allowing-http": googleapi: Error 403: Required 'compute.firewalls.get' permission for 'projects/stable-parsec-462607-h1/global/firewalls/allowing-http', forbidden

  with module.vm[0].google_compute_firewall.allowing-http,
  on ../modules/VM/main.tf line 23, in resource "google_compute_firewall" "allowing-http":
  23: resource "google_compute_firewall" "allowing-http" {


Error: Error when reading or editing ComputeFirewall "projects/stable-parsec-462607-h1/global/firewalls/allowing-https": googleapi: Error 403: Required 'compute.firewalls.get' permission for 'projects/stable-parsec-462607-h1/global/firewalls/allowing-https', forbidden

  with module.vm[0].google_compute_firewall.allowing-https,
  on ../modules/VM/main.tf line 41, in resource "google_compute_firewall" "allowing-https":
  41: resource "google_compute_firewall" "allowing-https" {


```
</details>

---
### 2. dir: `project1` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket1" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket1" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket1" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:53:02.520Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:53:02.520Z" -> null
      - url                         = "gs://bucket-geeta13-bucket1" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:53:02.520Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }
  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] has been deleted
- resource "google_storage_bucket" "bucket_name" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "bucket-geeta13-bucket3" -> null
      - labels                      = {} -> null
      - location                    = "ASIA-SOUTHEAST1" -> null
      - name                        = "bucket-geeta13-bucket3" -> null
      - project                     = "tonal-benefit-462606-b8" -> null
      - project_number              = 154871768797 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-geeta13-bucket3" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - time_created                = "2025-06-28T15:53:02.506Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2025-06-28T15:53:02.506Z" -> null
      - url                         = "gs://bucket-geeta13-bucket3" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2025-06-28T15:53:02.506Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket1"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket1"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

  # module.bucket[0].google_storage_bucket.bucket_name["bucket-geeta13-bucket3"] will be created
+ resource "google_storage_bucket" "bucket_name" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-SOUTHEAST1"
      + name                        = "bucket-geeta13-bucket3"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = (known after apply)
        }

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d project1`
* :put_litter_in_its_place: To **delete** this plan click [here](http://001f5d4a3f28:4141/lock?id=GeetaSree13%252Fterraform_new%252Fproject1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d project1`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
